; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	thermograph0 - mode
	image1 - mode
	GroundStation6 - direction
	Star7 - direction
	Star11 - direction
	Star8 - direction
	Star10 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation5 - direction
	GroundStation9 - direction
	Star4 - direction
	Star3 - direction
	Star12 - direction
	GroundStation0 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument2 image1)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star4)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation9)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument5 thermograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 GroundStation9)
	(calibration_target instrument5 GroundStation5)
	(supports instrument6 image1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star2)
	(supports instrument7 thermograph0)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation9)
	(calibration_target instrument7 Star12)
	(calibration_target instrument7 GroundStation5)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation6)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation0)
	(calibration_target instrument8 Star3)
	(supports instrument9 thermograph0)
	(supports instrument9 image1)
	(calibration_target instrument9 GroundStation0)
	(calibration_target instrument9 Star12)
	(calibration_target instrument9 Star3)
	(calibration_target instrument9 Star4)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star14)
)
(:goal (and
	(pointing satellite1 Star11)
	(pointing satellite2 Phenomenon16)
	(pointing satellite3 Star10)
	(have_image Phenomenon13 thermograph0)
	(have_image Star14 thermograph0)
	(have_image Phenomenon15 thermograph0)
	(have_image Phenomenon16 thermograph0)
	(have_image Star17 thermograph0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 8
2. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 0 of 8
3. (turn_to satellite0 phenomenon16 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon16)
   goals met: 0 of 8
4. (take_image satellite0 phenomenon16 instrument1 thermograph0)
   added: (have_image phenomenon16 thermograph0)
   goals met: 1 of 8
5. (turn_to satellite0 phenomenon15 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon15)
   goals met: 1 of 8
6. (take_image satellite0 phenomenon15 instrument1 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 2 of 8
7. (turn_to satellite0 phenomenon13 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 8
8. (take_image satellite0 phenomenon13 instrument1 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 3 of 8
9. (turn_to satellite0 star14 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star14)
   goals met: 3 of 8
10. (take_image satellite0 star14 instrument1 thermograph0)
   added: (have_image star14 thermograph0)
   goals met: 4 of 8
11. (turn_to satellite0 star17 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star17)
   goals met: 4 of 8
12. (take_image satellite0 star17 instrument1 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 5 of 8
13. (turn_to satellite1 star11 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star11)
   goals met: 6 of 8
14. (turn_to satellite2 phenomenon16 groundstation6)
   deleted: (pointing satellite2 groundstation6)
   added: (pointing satellite2 phenomenon16)
   goals met: 7 of 8
15. (turn_to satellite3 star10 star14)
   deleted: (pointing satellite3 star14)
   added: (pointing satellite3 star10)
   goals met: 8 of 8
